package com.natural.retention.photo;

public class 后激活字段检测 {
    public static void main(String[] args) {
        int[] fieldNum = {4, 2, 6, 30, 30, 8, 8, 1, 6, 2, 200, 40, 40, 40, 2, 200, 40, 2, 200, 40, 40, 40, 2, 200, 40, 40, 20, 400, 20, 400, 20, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40,
                40, 40, 40, 40, 40, 40, 40};
        int[] notNull = {1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1};

        String strCount = "34WA|34|034|2019010311575863331777466||20190103||0|01|01|刘羽|34118219981001582X|||||||||||||||||||||34WA201901151855176404271||||34WA201901151855176395261A|34WA201901151855176396361B||||||||||||8986091815340015741|15805152191|";
        String[] arr;

        arr = strCount.split("\\|", -1);
        if (arr.length < 51) {
            System.out.println("字段少");
        }

        // 判断每个字段是否过长,必填字段非空判断
        for (int i = 0; i < 51; i++) {
            if (arr[i].length() > fieldNum[i] || (arr[i].length() == 0 && notNull[i] == 1)) {
                System.out.println("第" + (i + 1) + "字段有问题");
            }
            System.out.println("第" + (i + 1) + "字段"+arr[i]+"长度限制"+fieldNum[i] +"判空"+notNull[i]);
        }

    }
}
